In [ ]:
!pip install update
!pip install pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'1.0.5'

# Pandas 개요

- panda 자료구조 
    - object : 문자열 
- Series
    df.info()
    - 생성 
        - pd.Series([ 값 배열], index=[인덱스 배열])
    - 명명
        - 시리즈객체.name = name/ 시리즈객체.index.name = name
    - 시리즈 프레임 값 확인 
        - 시리즈객체.values
        - 시리즈객체.index : 인덱스 임의 명명 가능
        - 시리즈객체.dtypes
    - 시리즈 인덱스 접근 
        - Series 객체[ idx ] 
        - Series 객체[[ idx1, idx2, idx4 ]]  < 이차원 배열 >
    - 딕셔너리를 이용한 시리즈 생성 
        - pd.Series(Dict) 
    - 시리즈 값들의 갯수 
        - 
- DataFrame
    - 생성
        - (1) 딕셔너리 = ( 키1 : 밸류1, 키2 : 밸류2 ... ) 형태  
            - data = dict(키1 : [values1], 키2 : [values2] .....)
            - df = pd.DataFrame(data)
        - (2) 딕셔너리 = { KEY1 : {key:val,key:val..}, KEY2 : {key:val.}} 형태(nested dictionary)
    - 삭제
        - 한개의 컬럼 삭제
            - del 데이터프레임[컬럼명]
        - 여러개의 컬럼/행 삭제
             - 행 삭제: DataFrame객체.drop(행 인덱스 또는 배열, axis=0, inplace = True/False) 
             - 열 삭제: DataFrame객체.drop(열 이름 또는 배열, axis=1, inplace = True/False)
                 - 여러 열 삭제 시 : drop( \[ 열 이름들 \], axis = 0, inplace = True/False )
                - axis : 1 = 열, 0 = 행 
                - inplace : True = 원본 객체를 이용, False = 복사본 이용 
    - 컬럼명, 인덱스명 설정
~~~python
pd.DataFrame(data, 
    columns = ['pop', 'year', 'state'], 
    index = ['one', 'two', 'three', 'forw', 'five'])
~~~
    - 데이터프레임 값 확인
        - df.index   : 행 방향의 인덱스 확인
        - df.columns : 열 방향 인덱스
        - df.values  : 값 확인 => 행 순서대로 추출이 됨 
        - df['column_name']
- 데이터프레임 인덱싱 
    - 결측치 다루기 
- 데이터프레임 다루기

# 1. Series 
- 1차원 배열의 데이터(NumPy 데이터 타입) 
- 인덱스 = 라벨, 각 데이터의 인덱스 라벨링 가능

## 1.1 Series 생성 : pd.Series(np.array)

In [44]:
series1 = pd.Series([4, 7, -5, 3])
series1

0    4
1    7
2   -5
3    3
dtype: int64

## 1.2. 시리즈 생성 : pd.Series(dict) 
- 인덱스 : 딕셔너리의 키
- 값 : 딕셔너리의 값 
- 인덱스 순서 : 딕셔너리의 인덱스 순으로 저장

In [45]:
sdata = {'Ohio' : 35000, 
         'Texas' : 71000, 
         'Oregon' : 16000, 
         'Utah': 5000}
series8 = pd.Series(sdata)
series8

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

### 1.2.1 Series와 인덱스
- pd.Series(데이터, 키)
    - 데이터의 인덱스와 키의 값 중 매칭되는 것이 없을 경우 값 = NaN
- Ohio, Texas, Utah에 대한 값이 states와 매칭됨 
- 기존 시리즈와 관련없이, 각 키-states와 매칭되는 value들이 나옴

In [46]:
series8

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

###### pd.Series(데이터, 키) 
- Colorado의 값 , 기존의 키와 매칭된느 것이 없음 ➤ NaN

In [8]:
states = {'Colorado', 'Ohio',  'Texas', 'Utah'}
series8 = pd.Series(sdata, states)
series8

Texas       71000.0
Colorado        NaN
Ohio        35000.0
Utah         5000.0
dtype: float64

## 1.3. 인덱스 명명 : 
- pd.Series([ 값 배열], index=[인덱스 배열])
- 시리즈객체.index = [인덱스 이름] 
- 인덱스 : 문자열, 날짜, 시간 등도 올 수 있음

In [9]:
series2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
series2

d    4
b    7
a   -5
c    3
dtype: int64

###### 인덱스 재라벨링

In [10]:
series2.index = ['😁','🤗','😅','😁']
series2

😁    4
🤗    7
😅   -5
😁    3
dtype: int64

## 1.3. 시리즈 객체,  시리즈 인덱스 명명

#### 시리즈 객체  / 인덱스 이름 지정 가능

In [11]:
series2.name = 'Practice'
series2.index.name = '🤗'
# obj.value.name = 'values'
series2

🤗
😁    4
🤗    7
😅   -5
😁    3
Name: Practice, dtype: int64

## 1.4. Series.values, Series.index, Series.dtypes 
- 시리즈 value, index, dtype 확인

In [12]:
series2

🤗
😁    4
🤗    7
😅   -5
😁    3
Name: Practice, dtype: int64

In [13]:
print(series2.values)
print(series2.index)
print(series2.dtypes)

[ 4  7 -5  3]
Index(['😁', '🤗', '😅', '😁'], dtype='object', name='🤗')
int64

## 1.5. 인덱스를 이용한 시리즈 value 접근 
- Series 객체[ idx ] 
- Series 객체[[ idx1, idx2, idx4 ]] 
    - 시리즈의 여러개의 값 선택해서 보기 : 이중 배열 
- Series 객체[start : end]

In [14]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'])
print(series3)
series3[['a', 'b', 'c']]

a    1
b    2
c    3
d    4
dtype: int64

a    1
b    2
c    3
dtype: int64

###### 1) 시리즈객체['인덱스 이름']

In [15]:
series3['a']

1

###### 2) 시리즈객체[인덱스 번호]

In [16]:
series3[0]

1

###### 3) 시리즈객체[시작 : 끝]

In [17]:
series3[1:3]

b    2
c    3
dtype: int64

## 1.6. 시리즈 간의 연산 
- NumPy의 연산들을 통한 연산(Filtering, Boolean Masking, Scalar Multiplication) 등의 연산을 하더라도 ' 인덱스(라벨)-값 '은 유지가 됨

In [18]:
series4 = pd.Series([1,2,3,4], index=['a','b','c','d'])
series4

a    1
b    2
c    3
d    4
dtype: int64

### 1.6.a 시리즈 연산 ( 같은 인덱스 시리즈 * 같은 인데스 시리즈 )

In [19]:
series4 * series4

a     1
b     4
c     9
d    16
dtype: int64

### 1.6.b 시리즈 연산 ( 같은 인덱스 시리즈 * 다른 인덱스 시리즈 )
- index가 맞느 않을 경우, 연산 결과에서 서로 다른 index는 NaN값이 들어감

In [20]:
series5 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'DDDDDDDD'])
series6 = pd.Series([10,20,30], index = ['a', 'b', 'FFFFFFFF'])

print(series5, series6, sep='\n\n')
print('____________________')
series5 * series6

a           1
b           2
c           3
DDDDDDDD    4
dtype: int64

a           10
b           20
FFFFFFFF    30
dtype: int64
____________________

DDDDDDDD     NaN
FFFFFFFF     NaN
a           10.0
b           40.0
c            NaN
dtype: float64

## 1.7. 키 in Series 연산

In [21]:
series7 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'DDDDDDDD'])
series7

a           1
b           2
c           3
DDDDDDDD    4
dtype: int64

In [22]:
'b' in series7

True

In [23]:
2 in series7

False

# 2. 데이터프레임 
- 공통 인덱스
- 하나의 열이 되는 데이터를 리스트/ 일차원 배열 준비
각 열에 대한 이름(label)과 키를 갖는 딕셔너리 생성
Pandas 의 DataFrame 클래스로 생성
열방향 인덱스는 Columns인수로 행방향 인덱스는 index인수로 지정

## 2.1. 데이터프레임 생성(1) : pd.DataFrame( Dict )

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 2.2. 데이터프레임 생성(2) : pd.DataFrame( JSON 데이터, Nested Dict )

In [47]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df2 = pd.DataFrame(data)
df2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

## 2.3. 데이터 프레임, 인덱스, 컬럼 명명
- df.index.name = name 
- df.columns.name = name

In [50]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df_name = pd.DataFrame(data)
df_name.index.name = 'Year'
df_name.columns.name = 'State'
df_name

State  Nevada  Ohio
Year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

## 2.4. 데이터프레임 열 삭제 : df.drop([columns...])
- drop(데이터프레임[컬럼명....], axis = 1 , inplace = True )
    - axis : 1 = 열, 0 = 행 
    - inplace : True = 원본 객체를 이용, False = 복사본 이용 
- del(데이터프레임[컬럼명])

In [51]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
             'Utah': {2000: 1.5, 2001: 1.8, 2002: 4.1}}
df_extra = pd.DataFrame(data)
df_extra

      Nevada  Ohio  Utah
2001     2.4   1.7   1.8
2002     2.9   3.6   4.1
2000     NaN   1.5   1.5

In [52]:
df_extra.drop(['Nevada'], axis = 1, inplace = False)

      Ohio  Utah
2001   1.7   1.8
2002   3.6   4.1
2000   1.5   1.5

## 2.5. 데이터 프레임 열 추가

In [53]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df3 = pd.DataFrame(data)
df3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

######  새로운 컬럼 추가 ( 1 ) : 같은 데이터 타입을 갖는 열 간의 연산

In [28]:
df3['year+population'] = df1['year'] + df1['pop']
df3

    state  year  pop  year+population
0    Ohio  2000  1.5           2001.5
1    Ohio  2001  1.7           2002.7
2    Ohio  2002  3.6           2005.6
3  Nevada  2001  2.4           2003.4
4  Nevada  2002  2.9           2004.9

###### 새로운 컬럼 추가 (2) : 다른 데이터 타입을 갖는 열 간의 연산
- df[새로운 컬럼] = df.컬럼네임.astype(타입) + df.컬럼네임 
- df[새로운 컬럼] = df[컬럼이름].astype(타입) + df[컬럼네임]

In [29]:
df3['nickname'] = df3['year'].astype(str) + df3['state']
df3

    state  year  pop  year+population    nickname
0    Ohio  2000  1.5           2001.5    2000Ohio
1    Ohio  2001  1.7           2002.7    2001Ohio
2    Ohio  2002  3.6           2005.6    2002Ohio
3  Nevada  2001  2.4           2003.4  2001Nevada
4  Nevada  2002  2.9           2004.9  2002Nevada

#### 새로운 컬럼 추가 (3) : 하나의 컬럼에 스트링/숫자 등 추가
- df[컬럼].astype(type) : 해당 열의 타입을 다른 타입으로 변경

In [30]:
df3['test_column'] = df3['pop'].astype(str) + '만 명'
df3

    state  year  pop  year+population    nickname test_column
0    Ohio  2000  1.5           2001.5    2000Ohio      1.5만 명
1    Ohio  2001  1.7           2002.7    2001Ohio      1.7만 명
2    Ohio  2002  3.6           2005.6    2002Ohio      3.6만 명
3  Nevada  2001  2.4           2003.4  2001Nevada      2.4만 명
4  Nevada  2002  2.9           2004.9  2002Nevada      2.9만 명

In [31]:
df3.drop(['year+population', 'nickname', 'test_column'], 
         axis = 1, 
         inplace = True)
df3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 2.6. 데이터 프레임 컬럼 순서 정하기
- pd.DataFrame(데이터, 컬럼 = [ c1, c2, c3 ] )

In [54]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df4 = pd.DataFrame(data)
df4

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### 데이터 컬럼 순서 변경

In [55]:
df5 = pd.DataFrame(data, columns = ['pop', 'year', 'state'])
df5

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada

## 2.6. 데이터 프레임 인덱스 이름 넣기
- 인덱스의 길이와 행의 길이가 같지 않으면 에러

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df6 = pd.DataFrame(data, 
                  columns = ['pop', 'year', 'state'], 
                  index = ['one', 'two', 'three', 'forw', 'five'])

df6

       pop  year   state
one    1.5  2000    Ohio
two    1.7  2001    Ohio
three  3.6  2002    Ohio
forw   2.4  2001  Nevada
five   2.9  2002  Nevada

#### data에 없는 컬럼을 전달할 경우, 해당 컬럼 : NaN

In [35]:
df7 = pd.DataFrame(data, columns = ['pop', 'year', 'state', '😁'])
df7

   pop  year   state    😁
0  1.5  2000    Ohio  NaN
1  1.7  2001    Ohio  NaN
2  3.6  2002    Ohio  NaN
3  2.4  2001  Nevada  NaN
4  2.9  2002  Nevada  NaN

## 2.7. 데이터프레임 인덱스, 열, 행 값 확인
- df.index   : 행 방향의 인덱스 확인
- df.columns : 열 방향 인덱스
- df.values  : 값 확인 => 행 순서대로 추출이 됨 
- df['column_name']

In [36]:
df8 = pd.DataFrame(data)
df8

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### 인덱스 갯수 확인

In [37]:
df8.index

RangeIndex(start=0, stop=5, step=1)

###### 열 확인

In [38]:
df8.columns

Index(['state', 'year', 'pop'], dtype='object')

###### 각 튜플 값 확인

In [39]:
df8.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9]], dtype=object)

## 2.8. 데이터 프레임 컬럼 추출 : __각 데이터 프레임의 컬럼은 하나의 시리즈__
- df['column_name']

In [40]:
print( df8['state'] )
print('----------------------------')
print( type(df8['state']) )  # Series 타입

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object
----------------------------
<class 'pandas.core.series.Series'>

## 2.9. 데이터프레임 컬럼 수정 ( 데이터프레임 * Scalar/Vector ) 
- 데이터프레임[컬럼명] = 스칼라 
- 데이터프레임[컬럼명] = 배열
    - 배열의 길이와 컬럼의 길이는 같아야 함

In [41]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df10 = pd.DataFrame(data)
df10

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### Scalar

In [42]:
df10['pop'] = 10
df10

    state  year  pop
0    Ohio  2000   10
1    Ohio  2001   10
2    Ohio  2002   10
3  Nevada  2001   10
4  Nevada  2002   10

###### vector

In [43]:
df10['pop'] = np.arange(5)
df10

    state  year  pop
0    Ohio  2000    0
1    Ohio  2001    1
2    Ohio  2002    2
3  Nevada  2001    3
4  Nevada  2002    4

# 3. 데이터프레임 인덱싱
- 1차원 인덱싱 ( 단일 컬럼, 단일 행 )
    - Column 인덱싱  : df['year] , df.year
    - Row 인덱싱 : df[start : end]
- 2차원 인덱싱 ( 다중 컬럼, 다중 행 )
    - loc 인덱싱 : 라벨값 기준 인덱싱

In [61]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df11 = pd.DataFrame(data)
df11

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 3.1. Column 인덱싱  : df['year] , df.year

In [60]:
df11['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

## 3.2. 행 단위 인덱싱 : df[ first_index : end_index ]

###### 정수 슬라이싱 인덱싱

In [85]:
df11[0:2]

    state  year  pop
one  Ohio  2000  1.5
two  Ohio  2001  1.7

In [86]:
df11.index = ['one', 'two', 'three', 'four', 'five']
df11

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

###### 인덱싱 이름으로 슬라이싱

In [87]:
df11['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

## 3.3. loc 인덱싱 : 인덱스 기반 인덱싱 
- df.loc[슬라이스 객체]
- df.loc[행, 컬럼]
- df.loc[행, [컬럼들]]
- df.loc[행(슬라이스)] [ 컬럼 ]
- df.loc[행(슬라이스)] [[ 컬럼들 ]]
___
- loc  : 인덱스만 사용 가능 
- iloc : 정수로만 인덱싱  
___
- cf)
    -> 1개 시리즈, 2개 데이터프레임 
    - 2개 이상 선택 시에는 대괄호 2개 
    - 슬라이싱 객체는 1개의 인덱스로

###### df.loc[행 인덱스]

In [120]:
df11.loc['two']   # 시리즈 반환 -> 대괄호 1개

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [108]:
df11.loc[['two']] # 데이터프레임 반환 -> 대괄호 2개

    state  year  pop
two  Ohio  2001  1.7

###### df.loc[슬라이스 객체]
- 슬라이스 객체 사용 시, 하나의 범위 = 하나의 인덱스와 같이 생각

In [134]:
df11.loc["two":"four"]

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

###### df.loc[ : , 컬럼 이름] -> 시리즈 반환

In [141]:
df11.loc[:,'state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

###### df.loc[행, [열,....]] -> 데이터프레임

In [145]:
df11.loc[:,['state']]

        state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada

In [146]:
df11.loc[['two', 'four', 'five']]

       state  year  pop
two     Ohio  2001  1.7
four  Nevada  2001  2.4
five  Nevada  2002  2.9

In [149]:
df11.loc['two':'five', ['state']]

        state
two      Ohio
three    Ohio
four   Nevada
five   Nevada

In [154]:
df11.loc['two':'five',:]

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

### 3.3.1 행 선택, 열선택 
- def.loc[행 인덱스] [ 열 인덱스 / 열 인덱스 슬라이스 ] 
    - 선택한 행 인덱스에 대해 열 인덱스에 대한 시리즈 반환 : 대괄호 1개
        - __대괄호 1개 사용시, 열 인덱스 1개 사용 ➤ 시리즈가 반환 객체 !__
- def.loc[행 인덱스] [[ 열 인덱스 / 열 인덱스 슬라이스 ]] 
    - 선택한 행 인덱스에 대해 열 인덱스에 대한 데이터프레임 반환 : 대괄호 2개

In [118]:
df11.loc['two':'four']['state']

two        Ohio
three      Ohio
four     Nevada
Name: state, dtype: object

###### loc[행, discrete columns]  ( 1 )

In [116]:
df11.loc['two':'four'][['state', 'pop']]

        state  pop
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4

###### loc[행, discrete columns]  ( 2 )

In [157]:
df11.loc['two':'four', ['state', 'pop']]

        state  pop
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4

In [155]:
df11.loc['two':'four']['state', 'pop'] # Error, 열 여러개 선택, 대괄호 1개 사용

KeyError: ('state', 'pop')

## 3.4. iloc 인덱싱 
- 정수 기반 인덱싱 
- df.iloc[행 인덱스][[ 컬럼 이름 인덱스 ]] 
- df.iloc[행 인덱스][[ 숫자 인덱스 ]] ➤ 에러 
    - iloc 밖에서 정수 기반 인덱스 처리 시 에러

In [187]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df12 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df12

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

In [188]:
df12.iloc[0:2]

        state  year  pop
one      Ohio  2000  1.5
two  Michigan  2001  1.7

In [189]:
df12.iloc[:, 0:3]

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

In [164]:
df12.iloc[:, [0,2]]

        state  pop
one      Ohio  1.5
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4
five   Nevada  2.9

In [168]:
df12.loc['one']['state']

'Ohio'

In [169]:
df12.iloc[0][0]

'Ohio'

In [173]:
df12.iloc[0:2, [0,1]]

    state  year
one  Ohio  2000
two  Ohio  2001

In [177]:
df12.iloc[0:2][['state', 'year']]

    state  year
one  Ohio  2000
two  Ohio  2001

In [174]:
df12.iloc[0:2][[0,1]] # Error

KeyError: "None of [Int64Index([0, 1], dtype='int64')] are in the [columns]"

## 3.5. 인덱싱을 통한 값 수정

In [184]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df13 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df13

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [185]:
df13.iloc[0:2, 0] = 'Colorad', 'Michigan'
df13

          state  year  pop
one     Colorad  2000  1.5
two    Michigan  2001  1.7
three      Ohio  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

## 3.6. Boolean 인덱싱

In [192]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'New York', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df14 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df14

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four   New York  2001  2.4
five     Nevada  2002  2.9

######  Series 객체 가져오기

In [223]:
df14['year'] == 2001

one      False
two       True
three    False
four      True
five     False
Name: year, dtype: bool

###### df.loc[시리즈 객체] ( 1 )

In [224]:
df14.loc[
    pd.Series([False,True,False,True,False], 
              index=['one','two','three', 'four', 'five'])
]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

###### df.loc[시리즈 객체] ( 2 )

In [225]:
df14.loc[df14['year'] == 2001]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

###### boolean indexing

In [229]:
boolean_idx = df14['year'] == 2001
boolean_idx

one      False
two       True
three    False
four      True
five     False
Name: year, dtype: bool

In [230]:
df14.loc[boolean_idx, ['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [231]:
df14.loc[boolean_idx][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [205]:
df14.loc[df14['year'] == 2001, ['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [206]:
df14.loc[df14['year'] == 2001][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [211]:
df14.loc[df14['year'] == 2001][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [209]:
df14.loc[ ( df14['year'] > 2000 ) & ( df14['year'] < 2002 ) ]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

In [235]:
iloc_practice = df14.iloc[:,1] > 2000
iloc_practice

one      False
two       True
three     True
four      True
five      True
Name: year, dtype: bool

In [238]:
df14.iloc[0:3, [0,1,2]]

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6

# 4. 데이터프레임 다루기

In [5]:
import numpy as np
import pandas as pd

In [7]:
np.random.seed(0)
df15 = pd.DataFrame(np.random.randn(6,4))
df15

          0         1         2         3
0  1.764052  0.400157  0.978738  2.240893
1  1.867558 -0.977278  0.950088 -0.151357
2 -0.103219  0.410599  0.144044  1.454274
3  0.761038  0.121675  0.443863  0.333674
4  1.494079 -0.205158  0.313068 -0.854096
5 -2.552990  0.653619  0.864436 -0.742165

## 4.1. 시계열 데이터 프레임 생성 
- pd.date_range('시작 날짜', peridos)

In [15]:
df15.columns = 'A', 'B', 'C', 'D'
df15.index = pd.date_range('20160701', periods = 6)
print( type(pd.date_range('20160701', periods = 6)) )
df15

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

                   A         B         C         D
2016-07-01  1.764052  0.400157  0.978738  2.240893
2016-07-02  1.867558 -0.977278  0.950088 -0.151357
2016-07-03 -0.103219  0.410599  0.144044  1.454274
2016-07-04  0.761038  0.121675  0.443863  0.333674
2016-07-05  1.494079 -0.205158  0.313068 -0.854096
2016-07-06 -2.552990  0.653619  0.864436 -0.742165

###### 특정 날짜 행 삭제 : pd.drop(pd.to_datetime('특정날짜')

In [82]:
df15.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### 여러 날짜 행 삭제 : pd.drop([pd.to_datetime('날짜'), pd.to_datetime('날짜')])

In [88]:
df15.drop([ pd.to_datetime('20160701'), pd.to_datetime('20160704') ])

                   A         B         C         D    F
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

## 4.2. 결측치 다루기 
- dropna(how=' option ', inplace = Falase) 
    - inplace = Flase 해당 데이터프레임에 대한 ‟__복사본__”을 반환 
    - inplace = True  해당 데이터프레임을 직접 수정 
- df.fillna(값)
- df.isnull()
- df.isna()

### 4.2.1. 결측치 데이터 삭제하기 
- df.dropna(how = ' option ' , axis = 행(0)/열(1) ) # default : 0
- axis = 1 : 열

###### a. 결측값을 갖는 컬럼 추가

In [19]:
df15['F'] = [ 1.0, np.nan, 3.5, 6.1, np.nan, 7.0]

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### b. 데이터프레임.dropna(how='any') : 행의 값 중 하나라도 NaN인 경우 행 빼고 보여줌

In [36]:
df15.dropna(how='any')

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

In [37]:
df15

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### c. df15.dropna(how='all') : 행의 모든 값이 NaN인 경우, 해당 행 빼고 보여줌

In [38]:
df15.dropna(how='all')

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

### 4.2.2. 결측치 갯수 및 확인하기 
- df.isnull() / df.isna()
    - 데이터프레임에서 NaN인 셀 = True, 아닌 경우 False를 갖는 데이터프레임 반환 
- df.isnull().sum() 
- df.isna().sum()

In [74]:
df15.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [77]:
df15.isna()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [78]:
df15.isnull().sum()

A    0
B    0
C    0
D    0
F    2
dtype: int64

In [53]:
df15.isna().sum()

A    0
B    0
C    0
D    0
F    2
dtype: int64

### 4.2.3. 결측값을 대체값으로 채우기( imputation )

In [79]:
df15

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### 특정값으로 채우기  : df.fillna(값)

In [59]:
df15.fillna(0.5)

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  0.5
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  0.5
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### 해당 컬럼의 유일한 값들만 가져오기

In [89]:
df15['F'].unique()

array([1. , nan, 3.5, 6.1, 7. ])

###### 결측값 대신, 평균값(분산, 표준편차 등..)을 대신 넣기

In [90]:
df15['F'].fillna(df15.F.mean())
df15['F'].fillna(df15.F.median())

2016-07-01    1.0
2016-07-02    4.8
2016-07-03    3.5
2016-07-04    6.1
2016-07-05    4.8
2016-07-06    7.0
Freq: D, Name: F, dtype: float64

# 5. 데이터 처리하기

## 5.1. 데이터 불러오기

### pd.read_파일형식( 경로, index_col=컬럼명/컬럼인덱스) )
- pd.read_csv(경로)
- pd.read_excel(경로)

In [99]:
df_csv = pd.read_csv('./보충자료/Pandas/data/read_csv_sample.csv')
df_csv

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [124]:
df_excel = pd.read_excel('./보충자료/Pandas/data/stock price.xlsx')
df_excel

       id stock_name          value   price
0  128940       한미약품   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280     녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400      쿠쿠홀딩스  179204.666667  177500
8  199800         툴젠   -2514.333333  115400
9  204210     모두투어리츠    3093.333333    3475

######  read_파일형식( 경로, 옵션1, 옵션2 ... )

<img src="./images/read_파일_옵션1.jpg" height = "70%" width = "70%" align = "left" >

<img src="./images/read_파일_옵션2.jpg" height = "70%" width = "70%" align = "left" >

## 5.2 데이터 쓰기 ( 데이터프레임.to_파일형식( 저장경로 )  )
- 헤더를 조절해줘야됨

In [125]:
df_excel.to_csv('./data.csv')

In [126]:
df_csv = pd.read_csv('./data.csv')

In [127]:
df_csv

   Unnamed: 0      id stock_name          value   price
0           0  128940       한미약품   59385.666667  421000
1           1  130960     CJ E&M   58540.666667   98900
2           2  138250      엔에스쇼핑   14558.666667   13200
3           3  139480        이마트  239230.833333  254500
4           4  142280     녹십자엠에스     468.833333   10200
5           5  145990        삼양사   82750.000000   82000
6           6  185750        종근당   40293.666667  100500
7           7  192400      쿠쿠홀딩스  179204.666667  177500
8           8  199800         툴젠   -2514.333333  115400
9           9  204210     모두투어리츠    3093.333333    3475

## 5.3 데이터 불러서 데이터 확인하기

In [11]:
titanic = pd.read_excel("http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls")

In [12]:
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [13]:
titanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [140]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

###### 결측치 확인

In [142]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

###### 결측치 처리

In [147]:
titanic['age'].value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
26.5000     1
67.0000     1
70.5000     1
76.0000     1
0.6667      1
Name: age, Length: 98, dtype: int64

In [150]:
titanic['age'].unique()

array([29.    ,  0.9167,  2.    , 30.    , 25.    , 48.    , 63.    ,
       39.    , 53.    , 71.    , 47.    , 18.    , 24.    , 26.    ,
       80.    ,     nan, 50.    , 32.    , 36.    , 37.    , 42.    ,
       19.    , 35.    , 28.    , 45.    , 40.    , 58.    , 22.    ,
       41.    , 44.    , 59.    , 60.    , 33.    , 17.    , 11.    ,
       14.    , 49.    , 76.    , 46.    , 27.    , 64.    , 55.    ,
       70.    , 38.    , 51.    , 31.    ,  4.    , 54.    , 23.    ,
       43.    , 52.    , 16.    , 32.5   , 21.    , 15.    , 65.    ,
       28.5   , 45.5   , 56.    , 13.    , 61.    , 34.    ,  6.    ,
       57.    , 62.    , 67.    ,  1.    , 12.    , 20.    ,  0.8333,
        8.    ,  0.6667,  7.    ,  3.    , 36.5   , 18.5   ,  5.    ,
       66.    ,  9.    ,  0.75  , 70.5   , 22.5   ,  0.3333,  0.1667,
       40.5   , 10.    , 23.5   , 34.5   , 20.5   , 30.5   , 55.5   ,
       38.5   , 14.5   , 24.5   , 60.5   , 74.    ,  0.4167, 11.5   ,
       26.5   ])

###### 기초 통계량 ( descriptive statistic ) 확인

In [152]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

## 데이터 관련 용어

<img src="./images/변수.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/데이터포인트.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/속성에따른분류.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/속성에따른분류2.jpg" height = "70%" width = "70%" align = "left" >

- 범주형 데이터
    - 명목형 데이터(Nominal Data) : 나이, 혈액형, 시도 등 
        - 타이타닉 : 사망/생존(0/1) 
    - 순서형 데이터(Ordinal Data) 
        - 학점(3.0 ~ 3.5 : B, 3.5 ~ 4.0 : B+), 비만도(BMI 20 ~ 28 : 정상 ... ) ➤ __수치형 자료를 그룹화__할 수 있는 것
        - ex) 타이타닉 -> pclass, embarked 
- 수치형 데이터 ( Numerical Data ) -> 연속형 
    - 이산형 데이터(Discretive Data) : 셀 수 있는 데이터 
    - 연속형 데이터(Continuous Data) : 연속적인 속성을 갖는 자료

## 6. 데이터프레임 정렬 
- sort_values : 값으로 하는 정렬
- sort_index : 인덱스로 하는 정렬

### 6.1 sort_values(asecnding = False) / sort_index()
- default : 오름차순 -> ascending = True 
- * 데이터프레임에서의 sort_values 
    - 옵션으로 by = 컬럼 사용 가능

In [4]:
s = pd.Series(np.random.randint(6, size=100))
s.head()

0    3
1    4
2    3
3    3
4    5
dtype: int64

###### sort_counts() / sort_index()

In [5]:
s.value_counts().sort_index()

0    17
1    18
2    10
3    19
4    19
5    17
dtype: int64

In [6]:
s.sort_values(ascending = False).head()

36    5
88    5
75    5
33    5
81    5
dtype: int64

In [7]:
s.sort_values(ascending=False).head()

36    5
88    5
75    5
33    5
81    5
dtype: int64

In [19]:
s.name = 'randint'
s.sort_values(by 'randint')

SyntaxError: invalid syntax (<ipython-input-19-7123e81f7e53>, line 2)

In [14]:
titanic['age'].sort_values(ascending = False)

14      80.0
61      76.0
1235    74.0
9       71.0
135     71.0
        ...
1293     NaN
1297     NaN
1302     NaN
1303     NaN
1305     NaN
Name: age, Length: 1309, dtype: float64

In [22]:
titanic.sort_values('age', ascending = False)[['pclass', 'name']]

      pclass                                               name
14         1               Barkworth, Mr. Algernon Henry Wilson
61         1  Cavendish, Mrs. Tyrell William (Julia Florence...
1235       3                                Svensson, Mr. Johan
135        1                          Goldschmidt, Mr. George B
9          1                            Artagaveytia, Mr. Ramon
...      ...                                                ...
1293       3                  Williams, Mr. Howard Hugh "Harry"
1297       3                             Wiseman, Mr. Phillippe
1302       3                                  Yousif, Mr. Wazli
1303       3                              Yousseff, Mr. Gerious
1305       3                              Zabour, Miss. Thamine

[1309 rows x 2 columns]

In [23]:
titanic.sort_values('age', ascending = False)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,NaN,NaN,NaN
135,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1293,3,0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1297,3,0,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN

###### sort_values([컬럼1, 컬럼2, ...], ascending = True)[[ 컬럼a, 컬럼b, 컬럼c]]....
- sort_values할 때, 
    - 컬럼1에 대해 정렬 
           - 컬럼2에 대해 정렬
    - 후 이 기준에 따라 컬럼a, 컬럼b, 컬럼c에 대해 보여줌 
- 아래의 경우, 나이를 먼저 정렬
    - 이후 나이에 따라 pclass를 정렬

In [28]:
a = titanic.sort_values(['age', 'pclass'], ascending = False)[['age', 'pclass', 'name']]
a.head(20)

       age  pclass                                               name
14    80.0       1               Barkworth, Mr. Algernon Henry Wilson
61    76.0       1  Cavendish, Mrs. Tyrell William (Julia Florence...
1235  74.0       3                                Svensson, Mr. Johan
9     71.0       1                            Artagaveytia, Mr. Ramon
135   71.0       1                          Goldschmidt, Mr. George B
727   70.5       3                               Connors, Mr. Patrick
506   70.0       2                        Mitchell, Mr. Henry Michael
81    70.0       1                       Crosby, Capt. Edward Gifford
285   67.0       1                                 Straus, Mr. Isidor
594   66.0       2                              Wheadon, Mr. Edward H
782   65.0       3                                   Duane, Mr. Frank
205   65.0       1                          Millet, Mr. Francis Davis
221   65.0       1                     Ostby, Mr. Engelhart Cornelius
78    64.0       1  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...
83    64.0       1  Crosby, Mrs. Edward Gifford (Catherine Elizabe...
115   64.0       1                                  Fortune, Mr. Mark
217   64.0       1                       Nicholson, Mr. Arthur Ernest
303   64.0       1                           Warren, Mr. Frank Manley
1261  63.0       3                             Turkula, Mrs. (Hedwig)
455   63.0       2                               Howard, Mr. Benjamin

### 7. 사용자 정의 함수 : apply - lambda 
- df.apply( 사용자 정의 함수, axis = 0/1 )

In [33]:
df = pd.DataFrame({ 
    'A': [1, 3, 4, 3, 4], 
    'B': [2, 3, 1, 2, 3], 
    'C': [1, 5, 2, 4, 4]
}) 

df

          0         1         2         3
0  0.587093 -1.295827  0.884618 -0.431438
1  1.144573  0.475028 -1.426634  0.817056
2  0.033610 -1.185936 -1.162776  1.934844
3  1.386708  0.436880  1.790480 -1.005622
4 -0.183660 -0.557082  0.500342 -0.282008
5 -1.029662 -0.094118 -2.672307  0.440623

###### Column에 대해 연산 
- 해당 연산만 axis = 1 일 경우 열

In [40]:
df.apply(lambda x : x.max() - x.min())

0    2.416370
1    1.770855
2    4.462787
3    2.940466
dtype: float64

In [41]:
df.apply(lambda x : x.max() - x.min(), axis = 1)

0    2.180446
1    2.571207
2    3.120779
3    2.796103
4    1.057424
5    3.112930
dtype: float64

In [46]:
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [48]:
df.value_counts

AttributeError: 'DataFrame' object has no attribute 'value_counts'

___

# A열에 1은 몇 개, 2는 몇 개, 3은 몇 개.. 에 대한 값  ∇

# ?????????????????????????????????????

In [51]:
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

___

In [63]:
titanic['survived'] = titanic['survived'].apply(lambda x : 'survived' if x == 0 else 'died').head(10)
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,died,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,died,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,survived,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,survived,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,survived,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,NaN,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,NaN,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,NaN,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,NaN,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,NaN,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN